package api.lang.string2;

public class Test06비밀번호검사 {
	public static void main(String[] args) {
		//(Q)정규표현식으로 반드시 한개 이상 포함이라는것을 검사할수있는가?
		//(Ex) 비밀번호-대문자/소문자/숫자/특수문자 반드시 1개포함
		//(.*?)아무글자나 있거나말거나
		//[a-z]+ :1이상
		//[a-z]* :0이상
		//[a-z]? :0번아니면 1번
		//Ex)^KSH정보교육원 (.*?) 지원$    스킵기호가 들어가면 삐처리 느낌
		
		
		//8-16자리의 영문 ,숫자,특수기호
		String password ="Student1234@";
		
		//String regex ="^[A-Za-z0-9!@#$]{8,16}$"; //반드시 1개 미구현
		//다 스킵하고 대문자가 1개 있는지 찾아
		//물음표는 앞에 있으면 지금부터 뒤에서 한개를 찾아라  !!(긍정탐색)
		//물음표가 뒤에 있으면 개수 
		//String regex ="^(?=(.*?)[A-Z]+)[A-Za-z0-9!@#$]{8,16}$";  /*다관심없고 대문자만 찾아*/
		String regex ="^(?=(.*?)[A-Z]+)(?=(.*?)[a-z]+)(?=(.*?)[0-9]+)"
				+ "(?=(.*?)[!@#$]+)[A-Za-z0-9!@#$]{8,16}$";
		//반드시 4개 구현
		System.out.println(password.matches(regex));
		
		
		
	}
}
